# Exploratory Data Analysis of Titanic Data Set

**About Data Set**


<!-- ![Data Dictionary](https://raw.githubusercontent.com/pankajsingh016/SDP/ladoo/Weekly%20challenges/images/week1titanic.png) -->
<img src="https://raw.githubusercontent.com/pankajsingh016/SDP/ladoo/Weekly%20challenges/images/week1titanic.png" width ="60%" height = "70%">

In [1]:
import pandas as pd
import numpy as np

### Importing Data Set

In [2]:
data = pd.read_csv(r"E:\Machine Learning\NoteBooks\ML\AIML\Data Git\SDP\Weekly challenges\Data\Titanic\train.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Checking the Rows and Column in Data

In [3]:
data.shape
# 891 Rows and 12 Columns

(891, 12)

In [4]:
# checking the null values
data.isna().sum()
# Age -> 177 values are missing
# Cabin -> 687 values are missing
# Embarked -> 2 values are missing

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Gender division of the Data

In [6]:
count=0
passanger = data['Sex']
for i in passanger:
    if i=='female':
        count+=1
print('Total Passanger -:',len(passanger))
print('Total Female -:',count)
print('Total Male -:',(len(passanger)-count))
print("% Female", (count/len(passanger)*100))
print("% Male",100 - (count/len(passanger)*100))

Total Passanger -: 891
Total Female -: 314
Total Male -: 577
% Female 35.24130190796858
% Male 64.75869809203142

### Class wise divsion of Data

In [7]:
data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [21]:
data.shape

(891, 12)

In [22]:
# calculating mean age of passangers
data.Age.mean()

29.69911764705882

## Working on the Data of Female Passanger
- Mean Age = 27 years
- Total Count = 314
- Total Survived = 233
- Survivor According to **Passanger Class**
-- Class 1 -: 91
-- Class 2 -: 70
-- Class 3 -: 72

In [38]:
female_data= data.loc[data['Sex']=='female']
female_data

pandas.core.frame.DataFrame

##### Mean Age of Female Passanger

In [31]:
# Mean Age of Female Passanger
print('Mean Age of Female Passanger -:',female_data.Age.mean())

Mean Age of Female Passanger -: 27.915708812260537

In [33]:
female_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 314 entries, 1 to 888
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  314 non-null    int64
 1   Survived     314 non-null    int64
 2   Pclass       314 non-null    int64
 3   Name         314 non-null    object
 4   Sex          314 non-null    object
 5   Age          261 non-null    float64
 6   SibSp        314 non-null    int64
 7   Parch        314 non-null    int64
 8   Ticket       314 non-null    object
 9   Fare         314 non-null    float64
 10  Cabin        97 non-null     object
 11  Embarked     312 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 31.9+ KB

In [45]:
# Total Female Survivors
survived = female_data[female_data['Survived']==1]
survived.shape

(233, 12)

In [46]:
# Total Female Survivors From class 1
survived = female_data.query('Survived==1 and Pclass ==1')
survived.shape

(91, 12)

In [47]:
# Total Female Survivors form class 2
survived = female_data.query('Survived==1 and Pclass == 2')
survived.shape

(70, 12)

In [48]:
# Total female Survivors from class 3
survived = female_data.query('Survived==1 and Pclass==3')
survived.shape

(72, 12)

In [58]:
female_data[female_data['Age']==female_data.Age.min()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C

In [59]:
female_data[female_data['Age']==female_data.Age.max()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S

In [13]:
Passanger_class = data['Pclass']

#for counting the number of people belong to any particular group
count1=0
count2=0
count3=0

# storing the age of the People according to their ticket class
Age1 = []
Age2 = []
Age3 = []

for index,i in enumerate(Passanger_class):
    if i == 1:
        count1+=1
        Age1 = Age1 + [data['Age'][index]]
    elif i == 2:
        count2+=1
        Age2 = Age2 + [data['Age'][index]]
    elif i == 3:
        count3+=1
        Age3 = Age3 + [data['Age'][index]]

print('Passanger Class 1:',count1)
print('Passanger Class 2:',count2)
print('Passanger Class 3:',count3)

Passanger Class 1: 216
Passanger Class 2: 184
Passanger Class 3: 491